// 学生学籍管理系统.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <iostream>

#include <iostream>
#include<iomanip>
#include<fstream>
#include<cstring>
#include<stdlib.h>
#include <windows.h>
#include<direct.h>
using namespace std;
#include "Student.h"
#include"List.h"
#include"Firs_Level_Menu.h"


void menu() {
	cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~" << endl;
	cout << "~~~~~~~~~~~~~~~~学生学籍管理系统~~~~~~~~~~~~~~~~" << endl;
	cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~" << endl;
	cout << "********请输入您想进行的操作所对应的数字********" << endl;
	cout << "******************（0）退出系统*****************" << endl;
	cout << "******************（1）录入学生*****************" << endl;
	cout << "******************（2）查找学生*****************" << endl;
	cout << "******************（3）删除学生*****************" << endl;
	cout << "******************（4）修改学生*****************" << endl;
	cout << "******************（5）学生排序*****************" << endl;
	cout << "******************（6）分类显示*****************" << endl;
	cout << "******************（7）清    屏*****************" << endl;
	cout << "******************（8）导出学生名单*************" << endl;
	cout << "******************（9）导入学生名单*************" << endl;
	cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~" << endl;
	cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~" << endl;

}

int main()
{
	char choice;
	while (1) {
		menu();
		cin >> choice;
		switch (choice)
		{
		case('0'):exit(); break;
		case ('1'):add(); break;
		case('2'):search(); break;
		case ('3'):del(); break;
		case('4'): edit(); break;
		case('5'):sort(); break;
		case('6'):show(); break;
		case('7'):clear(); break;
		case('8'):exportStuList(); break;
		case('9'):importStuList(); break;
		default:
			cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~``````" << endl
				<< "您进行了无效操作，请重新输入您想进行的操作所对应的数字" << endl
				<< "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~``````" << endl;
			break;
		}
	}
	system("PAUSE");
	return 0;
}


// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
